const musicdate={"f dur";["фа","соль","ля","си-бемоль","до","ре","ми"]}
const tonalities = {
  // Мажорные
  "до мажор":        ["до","ре","ми","фа","соль","ля","си"],
  "соль мажор":      ["соль","ля","си","до","ре","ми","фа-диез"],
  "ре мажор":        ["ре","ми","фа-диез","соль","ля","си","до-диез"],
  "ля мажор":        ["ля","си","до-диез","ре","ми","фа-диез","соль-диез"],
  "ми мажор":        ["ми","фа-диез","соль-диез","ля","си","до-диез","ре-диез"],
  "си мажор":        ["си","до-диез","ре-диез","ми","фа-диез","соль-диез","ля-диез"],
  "фа-диез мажор":   ["фа-диез","соль-диез","ля-диез","си","до-диез","ре-диез","ми-диез"],
  "до-диез мажор":   ["до-диез","ре-диез","ми-диез","фа-диез","соль-диез","ля-диез","си-диез"],

  "фа мажор":        ["фа","соль","ля","си-бемоль","до","ре","ми"],
  "си-бемоль мажор": ["си-бемоль","до","ре","ми-бемоль","фа","соль","ля"],
  "ми-бемоль мажор": ["ми-бемоль","фа","соль","ля-бемоль","си-бемоль","до","ре"],
  "ля-бемоль мажор": ["ля-бемоль","си-бемоль","до","ре-бемоль","ми-бемоль","фа","соль"],
  "ре-бемоль мажор": ["ре-бемоль","ми-бемоль","фа","соль-бемоль","ля-бемоль","си-бемоль","до"],
  "соль-бемоль мажор":["соль-бемоль","ля-бемоль","си-бемоль","до-бемоль","ре-бемоль","ми-бемоль","фа"],
  "до-бемоль мажор": ["до-бемоль","ре-бемоль","ми-бемоль","фа-бемоль","соль-бемоль","ля-бемоль","си-бемоль"],

  // Минорные (натуральные, параллельные к вышеуказанным мажорам)
  "ля минор":        ["ля","си","до","ре","ми","фа","соль"],
  "ми минор":        ["ми","фа-диез","соль","ля","си","до","ре"],
  "си минор":        ["си","до-диез","ре","ми","фа-диез","соль","ля"],
  "фа-диез минор":   ["фа-диез","соль-диез","ля","си","до-диез","ре","ми"],
  "до-диез минор":   ["до-диез","ре-диез","ми","фа-диез","соль-диез","ля","си"],
  "соль-диез минор": ["соль-диез","ля-диез","си","до-диез","ре-диез","ми","фа-диез"],
  "ре-диез минор":   ["ре-диез","ми-диез","фа-диез","соль-диез","ля-диез","си","до-диез"],
  "ля-диез минор":   ["ля-диез","си-диез","до-диез","ре-диез","ми-диез","фа-диез","соль-диез"],

  "ре минор":        ["ре","ми","фа","соль","ля","си-бемоль","до"],
  "соль минор":      ["соль","ля","си-бемоль","до","ре","ми-бемоль","фа"],
  "до минор":        ["до","ре","ми-бемоль","фа","соль","ля-бемоль","си-бемоль"],
  "фа минор":        ["фа","соль","ля-бемоль","си-бемоль","до","ре-бемоль","ми-бемоль"],
  "си-бемоль минор": ["си-бемоль","до","ре-бемоль","ми-бемоль","фа","соль-бемоль","ля-бемоль"],
  "ми-бемоль минор": ["ми-бемоль","фа","соль-бемоль","ля-бемоль","си-бемоль","до-бемоль","ре-бемоль"],
  "ля-бемоль минор": ["ля-бемоль","си-бемоль","до-бемоль","ре-бемоль","ми-бемоль","фа-бемоль","соль-бемоль"]
};